; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-5-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s2)
	(at driver4 s1)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at package1 s0)
	(at package2 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 22)
	(= (time-to-walk p0-1 s0) 22)
	(= (time-to-walk s1 p0-1) 67)
	(= (time-to-walk p0-1 s1) 67)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 35)
	(= (time-to-walk p0-2 s0) 35)
	(= (time-to-walk s2 p0-2) 65)
	(= (time-to-walk p0-2 s2) 65)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 66)
	(= (time-to-walk p2-1 s2) 66)
	(= (time-to-walk s1 p2-1) 97)
	(= (time-to-walk p2-1 s1) 97)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 47)
	(= (time-to-drive s1 s0) 47)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 15)
	(= (time-to-drive s2 s0) 15)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 24)
	(= (time-to-drive s1 s2) 24)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s2)
	(at driver3 s1)
	(at driver4 s0)
	(at truck1 s0)
	(at truck2 s1)
	(at truck3 s0)
	(at truck4 s2)
	(at package1 s0)
	(at package2 s2)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 4  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver4 truck3 s1)
   deleted: (at driver4 s1) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 2 of 10
2. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   changed: (walked) from 0 to 66
   goals met: 2 of 10
3. (load-truck package2 truck3 s1)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   goals met: 2 of 10
4. (drive-truck truck3 s1 s0 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 0 to 47
   goals met: 3 of 10
5. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 10
6. (walk driver3 p2-1 s1)
   deleted: (at driver3 p2-1)
   added: (at driver3 s1)
   changed: (walked) from 66 to 163
   goals met: 4 of 10
7. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 47 to 62
   goals met: 5 of 10
8. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 10
9. (disembark-truck driver4 truck3 s0)
   deleted: (driving driver4 truck3)
   added: (at driver4 s0) (empty truck3)
   goals met: 5 of 10
10. (board-truck driver4 truck5 s0)
   deleted: (at driver4 s0) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 4 of 10
11. (unload-truck package2 truck3 s0)
   deleted: (in package2 truck3)
   added: (at package2 s0)
   goals met: 4 of 10
12. (drive-truck truck5 s0 s2 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (driven) from 62 to 77
   goals met: 4 of 10
13. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 4 of 10
14. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 77 to 92
   goals met: 3 of 10
15. (drive-truck truck2 s2 s0 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 92 to 107
   goals met: 3 of 10
16. (drive-truck truck5 s2 s0 driver4)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (driven) from 107 to 122
   goals met: 3 of 10
17. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 3 of 10
18. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 3 of 10
19. (disembark-truck driver4 truck5 s0)
   deleted: (driving driver4 truck5)
   added: (at driver4 s0) (empty truck5)
   goals met: 4 of 10
20. (drive-truck truck4 s0 s2 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (driven) from 122 to 137
   goals met: 5 of 10
21. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 6 of 10
22. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 137 to 152
   goals met: 7 of 10
23. (board-truck driver4 truck2 s0)
   deleted: (at driver4 s0) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 6 of 10
24. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 7 of 10
25. (drive-truck truck2 s0 s2 driver4)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 152 to 167
   goals met: 7 of 10
26. (board-truck driver1 truck5 s0)
   deleted: (at driver1 s0) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 6 of 10
27. (drive-truck truck2 s2 s0 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (driven) from 167 to 182
   goals met: 6 of 10
28. (disembark-truck driver4 truck2 s0)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 7 of 10
29. (board-truck driver4 truck3 s0)
   deleted: (at driver4 s0) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 6 of 10
30. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 6 of 10
31. (drive-truck truck5 s0 s2 driver1)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (driven) from 182 to 197
   goals met: 6 of 10
32. (drive-truck truck3 s0 s2 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 197 to 212
   goals met: 5 of 10
33. (drive-truck truck5 s2 s0 driver1)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (driven) from 212 to 227
   goals met: 5 of 10
34. (load-truck package2 truck5 s0)
   deleted: (at package2 s0)
   added: (in package2 truck5)
   goals met: 5 of 10
35. (drive-truck truck5 s0 s2 driver1)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (driven) from 227 to 242
   goals met: 5 of 10
36. (unload-truck package2 truck5 s2)
   deleted: (in package2 truck5)
   added: (at package2 s2)
   goals met: 6 of 10
37. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   changed: (walked) from 163 to 230
   goals met: 5 of 10
38. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   changed: (walked) from 230 to 252
   goals met: 5 of 10
39. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 5 of 10
40. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 242 to 289
   goals met: 6 of 10
41. (disembark-truck driver3 truck2 s1)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 7 of 10
42. (drive-truck truck3 s2 s0 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 289 to 304
   goals met: 8 of 10
43. (disembark-truck driver4 truck3 s0)
   deleted: (driving driver4 truck3)
   added: (at driver4 s0) (empty truck3)
   goals met: 9 of 10
44. (drive-truck truck5 s2 s0 driver1)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (driven) from 304 to 319
   goals met: 9 of 10
45. (disembark-truck driver1 truck5 s0)
   deleted: (driving driver1 truck5)
   added: (at driver1 s0) (empty truck5)
   goals met: 10 of 10
